app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "here is my 10 char description change"], ["updated_at", "2015-12-29 05:39:19.875683"], ["id", 8]]
---
  def update
    if @article.update(article_params)

INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "article 1"], ["description", "This is article 1"], ["user_id", 6], ["created_at", "2016-01-24 03:39:32.426125"], ["updated_at", "2016-01-24 03:39:32.426125"]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save