app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]