app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "categories"
---
	def index
		@categories = Category.paginate(page: params[:page], per_page: 5)

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sports"], ["created_at", "2016-01-25 04:47:56.047893"], ["updated_at", "2016-01-25 04:47:56.047893"]]
---
	def create
		@category = Category.new(category_params)
		if @category.save