app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
	def index
		@users = User.paginate(page: params[:page], per_page: 5)

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
	def show
		@user_articles = @user.articles.paginate(page: params[:page], per_page: 5)

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "emails@blah.com"], ["password_digest", "$2a$10$.qQdVMANiPrRL3x8MF.Cle/pudUkeys2nvDfGaBu7Hinsymt5sPI2"], ["updated_at", "2016-01-12 04:03:15.505352"], ["id", 2]]
---
	def update
		if @user.update(user_params)