app/views/layouts/_navigation.html.erb

              <li><%= link_to "All Categories", categories_path %></li>
                <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"